Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/separation_and_divorce/divorce_decrees.html.txt.tmx
Source language: en
Languages: ga

source: A decree of divorce allows both parties to a marriage to remarry
ga: Ceadaíonn foraithne cholscartha don dá pháirtí pósta athphósadh a dhéanamh

source: If a court is satisfied that the required conditions (see 'Rules' below) are met, the court will grant the decree of divorce dissolving the marriage
ga: Má tá cúirt sásta go gcomhlíontar na coinníollacha riachtanacha (féach na Rialacha thíos), deonóidh an chúirt an fhoraithne cholscartha a dhíscaoileann an pósadh

source: When it grants the decree of divorce, the court may also make orders in relation to custody of children and access to them , the payment of maintenance and lump sums, the transfer of property, the extinguishment of succession rights, pension rights and other matters
ga: Nuair a dheonaíonn siad an fhoraithne cholscartha, féadfaidh an chúirt orduithe a dhéanamh maidir le caomhnóireacht leanaí agus rochtain orthu, cothabháil agus cnapshuimeanna a íoc, réadmhaoin a aistriú, cearta comharbais a chur ar ceal, cearta pinsin srl

source: As separating couples must have been living separate lives for a number of years before an application for a divorce is made, many obtain a separation agreement or a judicial separation to regulate matters between them before they seek a divorce
ga: Ciallaíonn an chaoi nach mór go raibh saol ar leith á chaitheamh ag na páirtithe amach óna chéile ar feadh líon blianta sula ndéantar iarratas ar cholscaradh go bhfaigheann go leor lánúineacha atá i mbun idirscartha comhaontú idirscartha nó idirscaradh breithiúnach chun ceisteanna a rialú eatarthu sula lorgaíonn siad colscaradh

source: In any application for a decree of divorce, the court can review any previous arrangements made by the parties, such as a separation agreement, particularly if the circumstances of either party have changed
ga: In aon iarratas ar fhoraithne cholscartha, féadfaidh an chúirt athbhreithniú a dhéanamh ar aon socruithe roimhe seo a rinne na páirtithe, ar nós comhaontú idirscartha, go háirithe má tháinig athrú ar chúinsí ceachtar páirtí

source: When a decree of divorce is granted, it cannot be reversed
ga: Nuair a dheonaítear foraithne cholscartha, ní féidir í a aisiompú

source: Either party can apply to court to have any orders made under the decree - such as maintenance - reviewed by the court
ga: Féadfaidh ceachtar páirtí iarratas a dhéanamh ar chúirt go ndéanfar aon orduithe faoin bhforaithne – ar nós cothabhála – a athbhreithníonn an chúirt

source: Before a court can grant a divorce, the following conditions must be met:
ga: Sular féidir cúirt colscaradh a dheonú, ní mór na coinníollacha a leanas a chomhlíonadh:

source: • The parties must have been living apart from one another for a period amounting to four out of the previous five years before the application is made
ga: • Ní mór go raibh na páirtithe ag cónaí amuigh óna chéile ar feadh tréimhse ceithre bliana le cúig bliana anuas sula ndéantar an t-iarratas

source: • There must be no reasonable prospect of reconciliation
ga: • Ní mór nach bhfuil aon ionchas réasúnta ann go mbainfear athmhuintearas amach

source: • Proper arrangements must have been made or will be made for the spouse and any dependent members of the family such as children of either party and other relatives
ga: • Ní mór go ndearnadh nó go ndéanfar socruithe cearta don chéile agus aon daoine muinteartha cleithiúnacha, ar nós leanaí ceachtar páirtí agus gaolta eile

source: Living apart is given a unique definition by the courts where parties can be "living apart" and still reside in the same dwelling
ga: Má chomhlíontar na coinníollacha seo, féadfaidh ceachtar páirtí i bpósadh iarratas a dhéanamh ar an gcúirt ar fhoraithne cholscartha

source: If the above conditions are met, either party to a marriage may apply to court for a decree of divorce. When applying for a divorce you must submit 4 documents to the Circuit Court:
ga: Nuair a bhíonn iarratas á dhéanamh ar cholscaradh, ní mór duit 4 cháipéis a sheoladh chuig an gCúirt Chuarda:

source: • An application form (known as a family law civil bill)
ga: • Foirm iarratais (ar a dtugtar bille sibhialta dlí teaghlaigh)

source: This document describes both you and your spouse, your occupations and where you live
ga: Déantar cur síos sa cháipéis seo ort féin agus ar do chéile, bhur ngairmeacha beatha agus cén áit a gcónaíonn sibh

source: It also sets out when you married, how long you have been living apart for and the names and birth dates of your children
ga: Leagtar amach inti, chomh maith, cathain a phós sibh, cé chomh fada atá sibh ag cónaí amuigh óna chéile agus ainmneacha agus ainmneacha breithe bhur leanaí

source: • A sworn statement of means (Form 37A)
ga: • Ráiteas acmhainne faoi mhionn (Foirm 37A)

source: This document sets out your assets, your income, your debts, your liabilities and your outgoings
ga: Leagtar amach sa cháipéis seo do shócmhainní, d’ioncam, d’fhiachas, do dhliteanais agus d’eisíocaíochtaí

source: • A sworn statement relating to the welfare of your children (Form 37B)
ga: • Ráiteas faoi mhionn a bhaineann le leas do leanaí (Foirm 37B)

source: This document sets out the personal details of the children of the marriage
ga: Leagtar amach sa cháipéis seo sonraí pearsanta faoi leanaí an phósta

source: It describes where they live and whot they live with
ga: Déanann sí cur síos ar an áit a gcónaíonn siad agus na daoine a gcónaíonn siad leo

source: It also describes their education and training, their health, childcare arrangements and maintenance and access arrangements
ga: Déanann sí cur síos ar a n-oideachas agus oiliúint, a sláinte, socruithe cúram leanaí agus socruithe cothabhála agus rochtana

source: • A document certifying that you have been advised of the alternatives to divorce (Form 37D)
ga: • Cáipéis a dheimhníonn gur cuireadh ar an eolas thú faoi na roghanna eile ar cholscaradh (Foirm 37D)

source: This document is sworn by a solicitor and it certifies that you have been advised about alternative dispute resolution, including the options of mediation and separation
ga: Mionnaíonn aturnae an cháipéis seo agus deimhníonn sí gur cuireadh ar an eolas thú faoi réiteach malartach díospóide, lena n-áirítear roghanna na hidirghabhála agus an idirscartha

source: When all of the necessary documents have been filed, you will be given a date for the court hearing
ga: Nuair a bhíonn na cáipéisí riachtanacha go léir comhdaithe, tabharfar dáta duit don éisteacht chúirte

source: The hearing will be held in private and you will need to show the court that you meet the requirements of the Family Law (Divorce) Act 1996
ga: Beidh an éisteacht ar siúl go príobháideach agus beidh ort a thaispeáint don chúirt go gcomhlíonann tú go hiomlán riachtanais an Achta um an Dlí Teaghlaigh (Colscaradh), 1996

source: You can read more about the factors considered by a court in a divorce case here
ga: Is féidir leat tuilleadh a léamh faoi na fachtóirí a ndéanann cúirt breithniú orthu i gcás colscartha anseo

source: If the court is satisfied that you have grounds for a divorce, it will grant a decree of divorce
ga: Má tá an chúirt sásta go bhfuil bunúis agat do cholscaradh, deonóidh siad foraithne cholscartha

source: Further information on applying for a divorce is available on the Courts Service website
ga: Tá fáil ar bhreis faisnéise ar iarratas a dhéanamh ar cholscaradh ar láithreán gréasáin na Seirbhíse Cúirteanna

source: You are not legally required to use a solicitor or a barrister
ga: Níl ceanglas dlíthiúil ort aturnae nó abhcóide a úsáid

source: In fact, if you wish, you can choose to represent yourself
ga: Féadfaidh tú, más mian leat, a roghnú chun ionadaíocht a dhéanamh duit féin, i ndáiríre

source: However, there may be complex issues that may make it very difficult to apply for a divorce without any professional help
ga: D’fhéadfadh roinnt saincheisteanna casta a bheith i gceist, áfach, a chruthódh mórdheacrachtaí duit iarratas a dhéanamh ar cholscaradh gan aon chabhair ghairmiúil

source: The family law civil bill (application form) and sample forms for the statement of means, the statement on children's welfare and the certificate that you have been advised of alternatives are available from the Courts Service website
ga: Tá an bille um an dlí teaghlaigh agus foirmeacha samplacha don ráiteas acmhainne, an ráiteas ar leas an linbh agus an deimhniú gur cuireadh ar an eolas thú ar roghanna eile ar fáil ó láithreán gréasáin na Seirbhíse Cúirteanna

source: You can also obtain copies of these documents from your nearest Circuit Court Office
ga: Chomh maith leis sin, féadfaidh tú cóipeanna a fháil, ó Oifig na Cúirte Cuarda is gaire duit

source: Legal advice and representation is always advisable
ga: Moltar i gcónaí comhairle dlí agus ionadaíocht a fháil

source: If you and your spouse disagree about any issue at all, you are strongly advised to see a family law solicitor
ga: Má easaontaíonn tú agus do chéile faoi aon saincheist in aon chor, moltar go mór duit casadh le haturnae dlí teaghlaigh

source: You and your spouse should not use the same solicitor
ga: Níor cheart duit féin agus do chéile an t-aturnae céanna a úsáid

source: To enquire whether you are eligible for legal aid, you can contact your nearest law centre
ga: Chun fiosrúchán a dhéanamh faoi cibé acu an bhfuil nó nach bhfuil tú incháilithe do chúnamh dlí, déan teagmháil leis an ionad dlí is gaire duit

source: Legal aid is not free and everyone must pay a contribution towards costs
ga: Níl cúnamh dlíthiúil saor in aisce agus tá ar gach duine ranníocaíocht a íoc i dtreo na gcostas

source: FLAC (Free Legal Advice Centres) is an independent, voluntary organisation that operates a network of legal advice clinics throughout the country
ga: Is eagraíocht neamhspleách, dheonach ICDS (Ionaid Chomhairle Dlí Saor in Aisce) a oibríonn líonra de chlinicí um chomhairle dhlíthiúil ar fud na tíre

source: These clinics are confidential, free of charge and open to all
ga: Tá na clinicí seo faoi rún agus saor in aisce do chách

source: Contact your nearest Citizens Information Centre for information on FLAC services in your area
ga: Déan teagmháil le d’Ionad um Fhaisnéis do Shaoránaigh chun teacht ar fhaisnéis ar sheirbhísí ICDS i do cheantar

source: FLAC also runs an information and referral line during office hours for basic legal information
ga: Ina theannta sin, tá líne faisnéise agus atreoraithe á reáchtáil ag an ICDS le linn uaireanta oifige le haghaidh faisnéis bhunúsach dhlíthiúil

source: If you choose to hire a private solicitor, you should be aware that there is no fixed rate of charges for legal fees
ga: Ma roghnaíonn tú chun aturnae príobháideach a fháil, ba cheart duit a bheith feasach nach ann d’aon ráta seasta muirear le haghaidh táillí dlí

source: You are advised to obtain some quotes before deciding on a legal firm
ga: Moltar duit roinnt meastacháin luacha a fháil sula ndéanann tú cinneadh ar ghnóthas dlíthiúil

source: Contact information for solicitors' firms throughout Ireland is available on the Law Society website
ga: Tá fáil ar fhaisnéis teagmhála do ghnóthais aturnaetha ar fud na hÉireann ar láithreán gréasáin Dhlí-Chumann na hÉireann
